# Описание решения задачи
**Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами**

_Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []_

## Описание работы программы
* Сначала командой **_Console.Clear()_** очищаем окно терминала.
* С помощью метода **_GetNumberFromUser("Укажите количество элементов массива для ввода строк: ", "Ошибка ввода!")_** запрашиваем у пользователя целое положительное число для размера одномерного массива для последующего ввода строк. Указанный метод запускает бесконеный цикл **_while (true)_**, условием выхода из которого является корректный ввод целого положительного числа. Методу в качестве параметров передаются 2 сообщения с предожением пользователю ввести число и информацией об ошибке ввода для случая некорректного ввода.
* Используя команду **_string[] stringArray = GetArray(arraySize)_**, создаем одномерный массив строк указанного пользователем размера. При помощи метода **_GetArray(arraySize)_** просим пользователя ввести в каждый элемент массива строку с клавиатуры. В ходе запущенного цикла каждому элементу массива присваивается введенное пользователем соответствующее значение.
* Командой **_string[] newStringArray = GetNewStringArray(stringArray)_** создаём новый массив для элементам первоначального массива, соответсвующих заданным критериям. Метод **_GetNewStringArray(stringArray)_** сначала при помщи цикла **_foreach_** находит количество элементов первончального массива, соответствующих требуемым критериям и сохраняет полученное значение в переменной count. Для отбора элементов первончального массива установлены следующие критерии: длина строки должна быть меньше или равна 3 и, одновременно, не должна иметь значение null, являеться пустой строкой или строкой, состоящей только из невидимых на экране символов-разделителей.
* Далее при помщи цикла **_for_** каждый i-элемент первоначального массива, соответсвующий вышеуказанным критериям, присваивается j-му элементу нового массива **_newStringArray_**.
* Последней командой **_Console.WriteLine($"[{String.Join(", ", stringArray)}] -> [{String.Join(", ", newStringArray)}]")_** в терминале выводятcя в удобном виде все элементы первоначального массива строк и элементы нового массива.